/**
 * あなたは、ある料理店でメニューを見ています。この料理店の料理名は複雑で、ある料理が食べたい料理であるか瞬時に判断するのが難しいです。
 *
 * あなたが食べたい料理の名前と、メニューに載っている料理名が 1 つ与えられるので、食べたい料理に合致するメニューであれば "Yes" を、そうでなければ "No" を出力するプログラムを作成してください。
 * 食べたい料理に合致するメニューとは、メニューの単語の中に食べたい料理名が入っていることを指します。
 *
 * 入力例 1 では、あなたは hamburg を食べたいと思っていて、与えられた料理名は cheese hamburg です。2 つ目の単語が、あなたの食べたい hamburg と一致しているため、"Yes" と出力します。
 * 評価ポイント
 * 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
 * より早い解答時間で提出したほうが得点が高くなります。
 * 複数のテストケースで正しい出力がされるか評価（+50点）
 * 解答までの速さ評価（+50点）
 * 入力される値
 * 入力は以下のフォーマットで与えられます。
 *
 * S
 * N
 * T_1 ... T_N
 * ・1 行目には、あなたの食べたい料理名を表す文字列 S が与えられます。
 * ・2 行目には、与えられるメニューの単語数を表す整数 N が与えられます。
 * ・3 行目には、メニュー名を表す単語の文字列 T_i (1 ≦ i ≦ N) が半角スペース区切りで与えられます。
 * ・入力は全部で 3 行となり、最終行末尾に改行が一つ入ります。
 *
 * それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
 * 期待する出力
 * 与えられたメニューがあなたの食べたい料理であれば "Yes" を、そうでなければ "No" を出力してください。
 * 出力最終行の末尾に改行を入れ、余計な文字、空行を含んではいけません。
 * 条件
 * すべてのテストケースにおいて、以下の条件をみたします。
 *
 * ・1 ≦ (S の長さ) ≦ 10
 * ・2 ≦ N ≦ 5
 * ・1 ≦ (T_i の長さ) ≦ 10 (1 ≦ i ≦ N)
 * ・S, T_i は英字小文字のみからなる
 */

// 入力値を切り替える。
const lines = ["hamburg", "2", "cheese hamburg"]; //出力: Yes
// const lines = ["apple","4", "spicy pizza with pineapple"] //出力: No
// const lines = ["udon","4", "hot pad thai noodles"] //出力: No

const wannaEatInMenu = (() => {
    const wannaEat = lines[0];
    const wordLength = lines[1];
    const menu = lines[2].split(" ");
    const yn = [];
    for (i = 0; i < wordLength; i++) {
        //   if (menu[i].match(`/^${wannaEat}$/`)){console.log("Yes")};
        if (menu[i] === (wannaEat)) {
            yn.push("Yes");
        } else {
            yn.push("No");
        }
    }
    const someRule = (str) => str === "Yes";
    const result = yn.some(someRule);
// 出力と一致すれば正解。
    if (result) {
        console.log("Yes");
    } else {
        console.log("No");
    }
    return result;
})();
